Revit 2024 API
ContourSetting.EnableItem Method
 Enable a contour setting item of the current contour setting so that the item will be used to draw contours.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void EnableItem(
	ContourSettingItem item
)
Visual Basic
Public Sub EnableItem ( _
	item As ContourSettingItem _
)
Visual C++
public:
void EnableItem(
	ContourSettingItem^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ContourSettingItem
 The contour setting item to be enabled.
Remarks
 Contour setting will not be changed if the item could not be found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace